<?php

$city = array (
    'Московская область' => array (
        'Москва',
        'Зеленоград',
        'Клин'
    ),
    'Ленинградская область' => array (
        'Санкт-Петербург',
        'Всеволожск',
        'Павловск'
    ),
    'Калининградская область' => array (
        'Калининград',
        'Черняховск',
        'Светлогорск'
    ),
);
foreach ($city as $key => $value){
    echo '<br>' . $key . ':<br>';

    foreach ($value as $key => $value){
        echo $value . '<br>';
    }
}
?>





