<?php

function trans ($lett) {
    $letters = array (
        "а" => "a",
        "б" => "b",
        "в" => "v",
        "г" => "g",
        "д" => "d",
        "е" => "e",
        "ё" => "yo",
        "ж" => "zh",
        "з" => "z",
        "и" => "i",
        "й" => "y",
        "к" => "k",
        "л" => "l",
        "м" => "m",
        "н" => "n",
        "о" => "o",
        "п" => "p",
        "р" => "r",
        "с" => "s",
        "т" => "t",
        "у" => "u",
        "ф" => "f",
        "х" => "x",
        "ц" => "ts",
        "ч" => "ch",
        "ш" => "sh",
        "щ" => "sh",
        "ъ" => "",
        "ы" => "i",
        "ь" => "",
        "э" => "e",
        "ю" => "yu",
        "я" => "ya",
        " " => " ",
    );
    $word = strtr($lett, $letters);
	echo "$word";
};
 trans("добрый день");
?>


